# RebarBarStirrupBendDiameter Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarBarStirrupBendDiameter Property
ParameterTypeId Class See Also
---
"Stirrup/Tie Bend Diameter"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarBarStirrupBendDiameter { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarBarStirrupBendDiameter As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarBarStirrupBendDiameter {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace